fabrika/src/InformationRegisters/ДДС/ДДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДДС</name>
  <comment>Хранит данные по ДДС холдинга</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СконвертированнаяСумма</name>
    <comment>Сумма после конвертации</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДеньВДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>НомерВБухгалтерии</name>
    <type>
      <types>DocumentRef.ТаможняРассчёты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <comment>Плановая дата прихода</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>105</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипОрганизации</name>
    <type>
      <types>EnumRef.ТипОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДвижения</name>
    <type>
      <types>EnumRef.ТипДвиженияДДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <types>CatalogRef.ПолучателиДДС</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорыКонтрагентов</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПлатежа</name>
    <type>
      <types>DocumentRef.ТаможняРассчёты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fabrika/src/InformationRegisters/НастройкаПолейОтправки/НастройкаПолейОтправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаПолейОтправки</name>
  <attributes>
    <name>Видимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДвижения</name>
    <type>
      <types>EnumRef.ТипДвиженияДДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <types>CatalogRef.ПолучателиДДС</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fabrika/src/InformationRegisters/ДДС/Forms/ФормаЗаписи/Module.bsl
//////////////////////////////////////ПРОЦЕДУРЫ И ФУНКЦИИ СОБЫТИЙ ФОРМЫ//////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НастройкаПолейОтправки = РегистрыСведений.НастройкаПолейОтправки.СоздатьНаборЗаписей();
	НастройкаПолейОтправки.Отбор.Организация.Установить(ТекущийОбъект.Организация);
	НастройкаПолейОтправки.Отбор.ТипДвижения.Установить(ТекущийОбъект.ТипДвижения);
	НастройкаПолейОтправки.Отбор.Получатель.Установить(ТекущийОбъект.Получатель);
	//
	НастройкаПолейОтправки.Прочитать();
	Если НастройкаПолейОтправки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проверьте настройки регистра сведений ""Настройка полей отправки!!!""",, "Запись.Организация");
		Отказ = Истина;
	КонецЕсли;	
	
	
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ////Блокируем изменение даты прихода, если есть документ - основание
    //Если ТипЗнч(Запись.НомерПлатежа) = Тип("ДокументСсылка.ТаможняРассчёты") Тогда
    //    Элементы.ДатаПоступления.Доступность = Ложь;
    //КонецЕсли;    
    //
    
КонецПроцедуры
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
